Tekla.Structures.Analysis.AnalysisMaterial
The AnalysisMaterial class contains the material information.

Tekla.Structures.Analysis.AnalysisMaterial._Name
Name.

Tekla.Structures.Analysis.AnalysisMaterial._MaterialType
The type of the material.

Tekla.Structures.Analysis.AnalysisMaterial._DampingFactor
The damping factor of the material.

Tekla.Structures.Analysis.AnalysisMaterial._Density
The density of the material.

Tekla.Structures.Analysis.AnalysisMaterial._ModulusOfElasticity
Modulus of eElasticity.

Tekla.Structures.Analysis.AnalysisMaterial._PoissonsRatio
Poissons ratio.

Tekla.Structures.Analysis.AnalysisMaterial._ThermalDilatation
Thermal dilatation.

Tekla.Structures.Analysis.AnalysisMaterial.Name
The name of the analysis material.

Tekla.Structures.Analysis.AnalysisMaterial.MaterialType
The type of the material.

Tekla.Structures.Analysis.AnalysisMaterial.DampingFactor
The damping factor of the material.

Tekla.Structures.Analysis.AnalysisMaterial.Density
The density of the material.

Tekla.Structures.Analysis.AnalysisMaterial.ModulusOfElasticity
The modulus of elasticity of the analysis material.

Tekla.Structures.Analysis.AnalysisMaterial.PoissonsRatio
The Poisson's ratio of the analysis material.

Tekla.Structures.Analysis.AnalysisMaterial.ThermalDilatation
The thermal dilatation of the analysis material.

Tekla.Structures.Analysis.AnalysisMaterial.Select
Selects an analysis material.
The AnalysisModelName has to be set.
The Name has to be set.

Tekla.Structures.Analysis.AnalysisMaterial.SelectInstance
DO NOT USE! For internal usage only!